XiaoSenLuo/bqueue/examples/stm32f030_usart_dma.c
    const uint16_t available = bq_length(&device->bqh_tx);
//    CRIT_SEC_E_;
    const uint16_t nsend = available && (available > sizeof(device->tx_buffer)) ? sizeof(device->tx_buffer) : available;
    device->tx_nfree = sizeof(device->tx_buffer) - nsend;
    if(nsend){
        bq_get(&device->bqh_tx, device->tx_buffer, nsend);
    }
    /**
     * @brief nsend = 0, 没有数据要发送, 但是此时最后一帧数据没有发送完成, 用户应该等待 tx_nfree == UINT8_MAX
     */
//    CRIT_SEC_X_;
}

static void usart_isr_handler_(void *ctx){
    usart_device_t *dev = (usart_device_t *)ctx;

    volatile uint32_t sr = dev->uart->SR;
    /// 空闲
    if((sr & USART_SR_IDLE)){
        LL_USART_ClearFlag_IDLE(dev->uart);
        usart_rx_dma_circle_post_(dev, DMA[dev->rx_dma.dma], DMA_STREAM[dev->rx_dma.stream]);
    }
    /// 发送完成
    if(sr & USART_SR_TC){
        LL_USART_ClearFlag_TC(dev->uart);
        LL_USART_DisableIT_TC(dev->uart);

//        usart_tx_circle_get_(dev, DMA[dev->tx_dma.dma], DMA_STREAM[dev->tx_dma.stream]);

        if(dev->tx_nfree != sizeof(dev->tx_buffer)){
            /// 继续发送
            LL_DMA_InitTypeDef dmaInitTypeDef = {
                    .Channel = DMA_CHANNEL[dev->tx_dma.channel],
                    .Direction = LL_DMA_DIRECTION_MEMORY_TO_PERIPH,
                    .Mode = LL_DMA_MODE_NORMAL,
                    .Priority = LL_DMA_PRIORITY_HIGH,
                    .PeriphOrM2MSrcIncMode = LL_DMA_PERIPH_NOINCREMENT,
                    .PeriphOrM2MSrcDataSize = LL_DMA_PDATAALIGN_BYTE,
                    .MemoryOrM2MDstIncMode = LL_DMA_MEMORY_INCREMENT,
                    .MemoryOrM2MDstDataSize = LL_DMA_MDATAALIGN_BYTE,
                    .FIFOMode = LL_DMA_FIFOMODE_DISABLE,
            };
            dmaInitTypeDef.PeriphOrM2MSrcAddress = LL_USART_DMA_GetRegAddr(dev->uart);
            dmaInitTypeDef.MemoryOrM2MDstAddress = (uint32_t)(dev->tx_buffer);
            dmaInitTypeDef.NbData = sizeof(dev->tx_buffer) - dev->tx_nfree;
            if(dmaInitTypeDef.NbData){
                uart_tx_dma_config_(dev->uart,
                                    DMA[dev->tx_dma.dma], DMA_STREAM[dev->tx_dma.stream], &dmaInitTypeDef);
            }
        }else{
            /// 所有数据发送完成
            dev->tx_nfree = UINT8_MAX;
        }
    }

    if(sr & USART_SR_ORE){    ///
        LL_USART_ClearFlag_ORE(dev->uart);
    }
}

static void usart1_isr_handler_(void *ctx){
#if defined(USE_USART1)
    usart_device_t *dev = (usart_device_t *)ctx;

    volatile uint32_t sr = dev->uart->SR;
    /// 空闲
    if((sr & USART_SR_IDLE)){
        LL_USART_ClearFlag_IDLE(dev->uart);
        usart_rx_dma_circle_post_(dev, DMA[dev->rx_dma.dma], DMA_STREAM[dev->rx_dma.stream]);
    }
    /// 发送完成
    if(sr & USART_SR_TC){
        LL_USART_ClearFlag_TC(dev->uart);
        LL_USART_DisableIT_TC(dev->uart);

//        usart_tx_circle_get_(dev, DMA[dev->tx_dma.dma], DMA_STREAM[dev->tx_dma.stream]);

        if(dev->tx_nfree != sizeof(dev->tx_buffer)){
            /// 继续发送
            LL_DMA_InitTypeDef dmaInitTypeDef = {
                    .Channel = DMA_CHANNEL[dev->tx_dma.channel],
                    .Direction = LL_DMA_DIRECTION_MEMORY_TO_PERIPH,
                    .Mode = LL_DMA_MODE_NORMAL,
                    .Priority = LL_DMA_PRIORITY_HIGH,
                    .PeriphOrM2MSrcIncMode = LL_DMA_PERIPH_NOINCREMENT,
                    .PeriphOrM2MSrcDataSize = LL_DMA_PDATAALIGN_BYTE,
                    .MemoryOrM2MDstIncMode = LL_DMA_MEMORY_INCREMENT,
                    .MemoryOrM2MDstDataSize = LL_DMA_MDATAALIGN_BYTE,
                    .FIFOMode = LL_DMA_FIFOMODE_DISABLE,
            };
            dmaInitTypeDef.PeriphOrM2MSrcAddress = LL_USART_DMA_GetRegAddr(dev->uart);
            dmaInitTypeDef.MemoryOrM2MDstAddress = (uint32_t)(dev->tx_buffer);
            dmaInitTypeDef.NbData = sizeof(dev->tx_buffer) - dev->tx_nfree;
            if(dmaInitTypeDef.NbData){
                uart_tx_dma_config_(dev->uart,
                                    DMA[dev->tx_dma.dma], DMA_STREAM[dev->tx_dma.stream], &dmaInitTypeDef);
            }
        }else{
            /// 所有数据发送完成
            dev->tx_nfree = UINT8_MAX;
        }
    }

    if(sr & USART_SR_ORE){    ///
        LL_USART_ClearFlag_ORE(dev->uart);
    }
#endif
}

static void usart2_isr_handler_(void *ctx) {
#if defined(USE_USART2)

#endif
}

static void usart3_isr_handler_(void *ctx) {
#if defined(USE_USART3)
#if(0)

    uart_device_t *dev = (uart_device_t *)ctx;

    register uint32_t sr = USART3->SR;
    if((sr & USART_SR_IDLE)){
        uint32_t pos = 0, length = 0;
        LL_USART_ClearFlag_IDLE(USART3);

        pos = LL_DMA_GetDataLength(USART3_RX_DMA, USART3_RX_DMA_STREAM);

        dev->rx_ring_buffer.tail = sizeof(dev->rx_ring_buffer.data) - pos;
        length = dev->rx_ring_buffer.tail - dev->rx_ring_buffer.head;
        if(dev->rx_ring_buffer.tail > dev->rx_ring_buffer.head){   /// 队尾大于队首
            LoopBuffer_Write(UART_USER_RX_BUFFER(uart3), &dev->rx_ring_buffer.data[dev->rx_ring_buffer.head], length);
            dev->rx_ring_buffer.length = length;
        }else
        if(dev->rx_ring_buffer.tail <= dev->rx_ring_buffer.head){   /// 队尾小于队头
            length = sizeof(dev->rx_ring_buffer.data) - dev->rx_ring_buffer.head;
            LoopBuffer_Write(UART_USER_RX_BUFFER(uart3), &dev->rx_ring_buffer.data[dev->rx_ring_buffer.head], length);
            length = dev->rx_ring_buffer.tail;
            LoopBuffer_Write(UART_USER_RX_BUFFER(uart3), &dev->rx_ring_buffer.data[0], length);
            dev->rx_ring_buffer.length = sizeof(dev->rx_ring_buffer.data) + dev->rx_ring_buffer.tail - dev->rx_ring_buffer.head;
        }
        dev->rx_ring_buffer.head = dev->rx_ring_buffer.tail;
        return ;
    }

    if(sr & USART_SR_ORE){    ///
        LL_USART_ClearFlag_ORE(USART3);
    }
#endif
#endif
}

static void uart_tx_dma_isr_handler_(void *ctx){

